In [3]:
import pandas as pd
import numpy as np
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [11]:
data

a  1   -1.050493
   2    0.884106
   3   -0.220430
b  1   -0.460142
   3   -0.768733
c  1    1.030007
   2    0.671512
d  2    1.194060
   3    0.059939
dtype: float64

In [5]:
data['b']

1   -0.460142
3   -0.768733
dtype: float64

In [6]:
data['b':'c']

b  1   -0.460142
   3   -0.768733
c  1    1.030007
   2    0.671512
dtype: float64

In [7]:
data.loc[['b', 'd']]

b  1   -0.460142
   3   -0.768733
d  2    1.194060
   3    0.059939
dtype: float64

In [8]:
data.loc[:, 2]

a    0.884106
c    0.671512
d    1.194060
dtype: float64

In [9]:
data.unstack()

          1         2         3
a -1.050493  0.884106 -0.220430
b -0.460142       NaN -0.768733
c  1.030007  0.671512       NaN
d       NaN  1.194060  0.059939

In [10]:
data.unstack().stack()

a  1   -1.050493
   2    0.884106
   3   -0.220430
b  1   -0.460142
   3   -0.768733
c  1    1.030007
   2    0.671512
d  2    1.194060
   3    0.059939
dtype: float64

In [12]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
frame.index.names = ['key1', 'key2']

In [14]:
frame.columns.names = ['state', 'color']

In [15]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [16]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10